cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/fuse'
tap 'homebrew/binary'
tap 'homebrew/command-not-found'
tap 'homebrew/aliases'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'vitorgalvao/tiny-scripts'
tap 'ethereum/ethereum'
tap 'srcclr/srcclr'

# Install homebrew packages
brew 'grc'
brew 'coreutils'
brew 'spark'
brew 'zsh'
brew 'zsh-completions'
brew 'antigen'
brew 'vitorgalvao/tiny-scripts/cask-repair'
brew 'mas'               # Install appstore programs from command line

# Misc/Unsorted
brew 'ethereum/ethereum/ethereum'
cask 'adobe-reader'
cask 'evernote'
cask 'rescuetime'
#cask 'java'
mas 'Kindle', id: 405399194
mas 'Reditr', id: 572716744
mas 'Microsoft Remote Desktop', id: 715768417
mas 'TNEFs Enough', id: 986621173

# Internet/Download
cask 'google-chrome'
#cask 'google-drive'
cask 'dropbox'
cask 'resilio-sync'
brew 'wget'
#brew 'youtube-dl'
brew 'aria2'

# Chat/Social
cask 'skype'
#cask 'slack'
mas 'Slack', id: 803453959
cask 'sempahor'
cask 'adium'
cask 'franz'
mas 'Textual', id: 896450579

# Productivity
cask 'fantastical'
mas 'Wunderlist', id: 410628904
mas 'Pomodone', id: 1096128050
#cask 'pomodone'

# Gaming
cask 'steam'
cask 'league-of-legends'

# Media/Music/Etc
cask 'spotify'
cask 'vlc'
cask 'lastfm'
cask 'audacity'
brew 'x265'
cask 'handbrake'

# Docs/Notes/Etc
mas 'Outline', id: 604802021

# Dev/Etc
mas 'Xcode', id: 497799835
brew 'nodenv'           # See node/install.sh
brew 'node-build'       # See node/install.sh
brew 'rbenv'            # See ruby/install.sh
brew 'ruby-build'       # See ruby/install.sh
brew 'pyenv'            # See python/install.sh
brew 'pyenv-virtualenv' # See python/install.sh
brew 'jenv'             # See jenv/install.sh
brew 'git'
brew 'hub'
brew 'typesafe-activator'
brew 'haskell-stack'
cask 'sublime-text3'
cask 'atom'
cask 'sourcetree'
cask 'intellij-idea'
brew 'nasm'
brew 'libsodium'

# Security/Pentest/Etc
brew 'exiftool'
brew 'john-jumbo'
cask 'keybase'
brew 'nmap'
brew 'sslyze'
brew 'exploitdb'
brew 'afl-fuzz'
brew 'jad'    # Java Decompiler (http://tools.kali.org/reverse-engineering/jad)
cask 'jd-gui' # Java Decompiler (http://tools.kali.org/reverse-engineering/jd-gui)
cask 'synalyze-it-pro'
cask '0xed'
cask 'hex-fiend'
cask 'wireshark'
#cask 'lastpass'
cask 'viscosity'
brew 'proxychains-ng'
brew 'srcclr'
cask 'burp-suite'
cask 'owasp-zap'

# System/Etc
#brew 'homebrew/fuse/ntfs-3g'
mas 'The Unarchiver', id: 425424353
brew 'unrar'
brew 'tmux'
#cask 'razer-synapse'
#cask 'osxfuse'
cask 'asepsis'
cask 'alfred'
cask 'lacona'
cask 'bartender'
cask 'bettertouchtool'
cask 'flux'
cask 'hyperdock'
cask 'iterm2'
#cask 'totalfinder'
#cask 'totalterminal'
cask 'nosleep'
mas 'Caffeine', id: 411246225

cask 'qlstephen' # Preview textfiles without extensions
cask 'disk-inventory-x'

# VM/Etc
cask 'virtualbox'
cask 'docker'
cask 'kitematic'
#cask 'parallels-desktop'
#cask 'vagrant'
#cask 'vagrant-bar'
