cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/fuse'
tap 'homebrew/binary'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'vitorgalvao/tiny-scripts'
tap 'ethereum/ethereum'

# Install homebrew packages
brew 'grc'
brew 'coreutils'
brew 'spark'
brew 'zsh'
brew 'zsh-completions'
brew 'antigen'
brew 'vitorgalvao/tiny-scripts/cask-repair'

# Misc/Unsorted
brew 'ethereum/ethereum/ethereum'
cask 'adobe-reader'
cask 'evernote'
cask 'rescuetime'
cask 'java'

# Internet/Download
cask 'google-chrome'
cask 'google-drive'
cask 'dropbox'
cask 'bittorrent-sync'
brew 'wget'
brew 'youtube-dl'
brew 'aria2'

# Chat/Social
cask 'skype'
cask 'slack'

# Productivity
cask 'pomodone'

# Gaming
cask 'steam'
cask 'league-of-legends'

# Media/Music/Etc
cask 'spotify'
cask 'vlc'
cask 'lastfm'
cask 'audacity'

# Dev/Etc
brew 'nodenv'           # See node/install.sh
brew 'node-build'       # See node/install.sh
brew 'rbenv'            # See ruby/install.sh
brew 'ruby-build'       # See ruby/install.sh
brew 'pyenv'            # See python/install.sh
brew 'pyenv-virtualenv' # See python/install.sh
brew 'jenv'             # See jenv/install.sh
brew 'git'
brew 'hub'
brew 'typesafe-activator'
cask 'sublime-text3'
cask 'sourcetree'
cask 'intellij-idea'
brew 'nasm'

# Security/Pentest/Etc
brew 'exiftool'
brew 'john-jumbo'
brew 'keybase'
brew 'nmap'
brew 'exploitdb'
brew 'afl-fuzz'
brew 'jad'    # Java Decompiler (http://tools.kali.org/reverse-engineering/jad)
cask 'jd-gui' # Java Decompiler (http://tools.kali.org/reverse-engineering/jd-gui)
cask '0xed'
cask 'wireshark'
cask 'lastpass'
cask 'viscosity'

# System/Etc
brew 'homebrew/fuse/ntfs-3g'
brew 'unrar'
brew 'tmux'
#cask 'razer-synapse'
cask 'osxfuse'
cask 'asepsis'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'flux'
cask 'hyperdock'
cask 'iterm2'
#cask 'totalfinder'
#cask 'totalterminal'
cask 'nosleep'

cask 'qlstephen' # Preview textfiles without extensions
cask 'disk-inventory-x'

# VM/Etc
cask 'virtualbox'
cask 'dockertoolbox'
cask 'parallels-desktop'
cask 'vagrant'
cask 'vagrant-bar'
