antigen
aria2
autoconf
cask-repair
coreutils
ethereum
exiftool
gdbm
gettext
git
gmp
grc
hr
hub
jenv
john-jumbo
keybase
mercurial
nmap
node
ntfs-3g
openssl
pcre
pkg-config
rbenv
readline
ruby-build
spark
typesafe-activator
unrar
wget
zsh
zsh-completions
