0xed
adobe-reader
alfred
asepsis
audacity
bartender
bettertouchtool
disk-inventory-x
dockertoolbox
dropbox
evernote
flux
google-chrome
google-drive
hyperdock
intellij-idea
lastfm
lastpass
league-of-legends
minecraft
nosleep
osxfuse
parallels-desktop
qlstephen
razer-synapse
rescuetime
skype
sourcetree
spotify
steam
sublime-text3
totalfinder
totalterminal
vagrant
vagrant-bar
virtualbox
viscosity
vlc
wireshark
