tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'ethereum/ethereum'
tap 'homebrew/bundle'
tap 'homebrew/fuse'
tap 'vitorgalvao/tiny-scripts'
cask 'osxfuse'
brew 'antigen'
brew 'pkg-config'
brew 'aria2'
brew 'autoconf'
brew 'gmp'
brew 'coreutils'
brew 'exiftool'
brew 'gdbm'
brew 'gettext'
brew 'pcre'
brew 'git'
brew 'grc'
brew 'hr'
brew 'hub'
brew 'jenv'
brew 'openssl'
brew 'john-jumbo'
brew 'keybase'
brew 'mercurial'
brew 'nmap'
brew 'node'
brew 'ruby-build'
brew 'rbenv'
brew 'readline'
brew 'spark'
brew 'typesafe-activator'
brew 'unrar'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'ethereum/ethereum/ethereum'
brew 'homebrew/fuse/ntfs-3g'
brew 'vitorgalvao/tiny-scripts/cask-repair'
cask '0xed'
cask 'adobe-reader'
cask 'alfred'
cask 'asepsis'
cask 'audacity'
cask 'bartender'
cask 'bettertouchtool'
cask 'disk-inventory-x'
cask 'dockertoolbox'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'hyperdock'
cask 'intellij-idea'
cask 'lastfm'
cask 'lastpass'
cask 'league-of-legends'
cask 'minecraft'
cask 'nosleep'
cask 'parallels-desktop'
cask 'qlstephen'
cask 'razer-synapse'
cask 'rescuetime'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'sublime-text3'
cask 'totalfinder'
cask 'totalterminal'
cask 'vagrant'
cask 'vagrant-bar'
cask 'virtualbox'
cask 'viscosity'
cask 'vlc'
cask 'wireshark'
